# Taps
# ------------------------------------------------------------------------------

tap "homebrew/dupes"
tap "homebrew/versions"
tap "homebrew/nginx"
tap "homebrew/php"
tap "homebrew/services"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/command-not-found"
tap "blackfireio/homebrew-blackfire"

# Homebrew
# ------------------------------------------------------------------------------

# Terminal and stuff
brew "coreutils"
brew "zsh"
brew "zsh-completions"
brew "homebrew/dupes/grep"

# Utilities
brew "curl"
brew "git-ftp"
brew "git"
brew "htop-osx"
brew "hub"
brew "mackup"
brew "tree"
brew "watch"
brew "wget"

# Web server
brew "nginx"
brew "mysql"

# Node and Ruby
brew "node"
brew "ruby"

# PHP
brew "php56", args: ['without-apache']
brew "php56-xdebug"
brew "php70", args: ['with-thread-safety', 'without-apache']
brew "php70-pthreads"
brew "php70-mailparse"
brew "composer"

# Caskroom
# ------------------------------------------------------------------------------

# General
cask "adobe-creative-cloud"
cask "adobe-reader"
cask "boom"
cask "dropbox"
cask "google-chrome-dev"
cask "lastfm"
cask "libreoffice"
cask "screenflick"
cask "spectacle"

# Work
cask "atom"
cask "colorsnapper"
cask "cyberduck"
cask "dash"
cask "harvest"
cask "iterm2-beta"
cask "paw"
cask "phpstorm-eap"
cask "querious"
cask "skype"
cask "slack"
cask "sourcetree"
cask "vagrant"
cask "virtualbox"

# Gaming and medias
cask "couchpotato"
cask "plex-media-server"
cask "sonarr"
cask "steam"
cask "transmission"
cask "vlc"

# Quicklook
cask "betterzipql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# Fonts
cask "font-fira-code"
