# Taps
# ------------------------------------------------------------------------------

tap "blackfireio/blackfire"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/nginx"
tap "homebrew/php"
tap "homebrew/services"
tap "homebrew/versions"
tap "tldr-pages/tldr"

# Homebrew
# ------------------------------------------------------------------------------

# Terminal and stuff
brew "bash"
brew "tldr"
brew "coreutils"
brew "grep"
brew "zsh-completions"
brew "zsh"

# Utilities
brew "bat"
brew "curl"
brew "git-fresh"
brew "git-ftp"
brew "git"
brew "hub"
brew "mackup"
brew "mas"
brew "rename"
brew "tldr"
brew "tree"
brew "watch"
brew "wget"
brew "z"
brew "zplug"

# Web server
brew "mysql"
brew "nginx"
brew "redis"

# Node and Ruby
brew "node", link: false
brew "node@8", link: true
brew "ruby"
brew "yarn"

# PHP
brew "php"
brew "php@5.6"
brew "php@7.0"
brew "php@7.1"
brew "blackfireio/blackfire/blackfire-agent"
brew "composer"

# Caskroom
# ------------------------------------------------------------------------------

# General
cask "1password"
cask "cleanmymac"
cask "dropbox"
cask "brave-browser"
cask "goofy"
cask "notion"
cask "lastfm"
cask "libreoffice"
cask "screenflick"

# Utilities
cask "alfred"
cask "bartender"
cask "spectacle"
cask "the-unarchiver"
cask "unlox"

# Work
cask "cyberduck"
cask "dash"
cask "focus"
cask "harvest"
cask "paw"
cask "phpstorm"
cask "postman"
cask "tableplus"
cask "sketch"
cask "slack"
cask "sourcetree"
cask "visual-studio-code"

# Gaming and medias
cask "plex-media-server"
cask "radarr"
cask "sonarr"
cask "steam"
cask "transmission"
cask "vlc"

# Quicklook
cask "betterzipql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# Fonts
cask "font-ibm-plex"

# Mac App Store
# ------------------------------------------------------------------------------

mas "Reeder", id: 880001334
mas "Sip", id: 507257563
mas "Keynote", id: 409183694
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
